examples/advanced_dbml.dbml.dot
digraph dbml {
      rankdir=LR;
      graph [fontname="helvetica", fontsize=32, fontcolor="#29235c", bgcolor="transparent"];
      node [penwidth=0, margin=0, fontname="helvetica", fontsize=32, fontcolor="#29235c"];
      edge [fontname="helvetica", fontsize=32, fontcolor="#29235c", color="#29235c"];

      
      subgraph cluster_users {
      tooltip="users\nUser details"
      label="users"
      style=filled;
      color="#dddddd";

      "users.users" [id="users.users";URL="https://github.com/softwaretechnik-berlin/dbml-renderer";tooltip="users.users\na test note";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#D3D3D3"><FONT COLOR="#000000"><B>       users.users       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>Id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I> <B>(!)</B></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">Name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar(max)</I> <B>(!)</B></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">Sex    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"users.sexes" [id="users.sexes";URL="https://github.com/softwaretechnik-berlin/dbml-renderer";tooltip="users.sexes\nMale or female";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#200000"><FONT COLOR="#ffffff"><B>       users.sexes       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>Id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I> <B>(!)</B></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">Name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar(10)</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
    }
subgraph cluster_teams {
      tooltip="teams\nThe team tables"
      label="teams"
      style=filled;
      color="#fcecec";

      "teams" [id="teams";tooltip="teams\nAnother note";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       teams       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>Id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">Name    </TD>
          <TD ALIGN="RIGHT"><FONT><I>varchar(20)</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
"teams_users" [id="teams_users";URL="https://github.com/softwaretechnik-berlin/dbml-renderer";label=<<TABLE BORDER="2" COLOR="#29235c" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
      <TR><TD PORT="f0" BGCOLOR="#1d71b8"><FONT COLOR="#ffffff"><B>       teams_users       </B></FONT></TD></TR>
<TR><TD ALIGN="LEFT" PORT="f1" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT"><B>Id</B>    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f2" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">TeamId    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
<TR><TD ALIGN="LEFT" PORT="f3" BGCOLOR="#e7e2dd">
      <TABLE CELLPADDING="0" CELLSPACING="0" BORDER="0">
        <TR>
          <TD ALIGN="LEFT">UserId    </TD>
          <TD ALIGN="RIGHT"><FONT><I>int</I></FONT></TD>
        </TR>
      </TABLE>
    </TD></TR>
    </TABLE>>];
    }
      
      "users.users":f0 -> "users.sexes":f0 [style=invis, weight=100, color=red]
    "users.users":f3:e -> "users.sexes":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"teams_users":f0 -> "teams":f0 [style=invis, weight=100, color=red]
    "teams_users":f2:e -> "teams":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
"teams_users":f0 -> "users.users":f0 [style=invis, weight=100, color=red]
    "teams_users":f3:e -> "users.users":f1:w [dir=forward, penwidth=3, color="#29235c", headlabel="1", taillabel="*"]
      
    }
